Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/arrests/unlawful_arrest_and_detention.html.txt.tmx
Source language: en
Languages: ga

source: Unlawful arrest and detention
ga: Gabháil agus coinneáil neamhdhleathach

source: In order to arrest you, the Garda Siochana must have a warrant for your arrest unless you are arrested for an offence that is punishable by imprisonment for a term of 5 years or more
ga: Más mian leis an nGarda Síochana tú a ghabháil ní mór barántas gafa a bheith acu ach amháin sa chás go bhfuil tú gafa as coir lena mbaineann téarma príosúnachta de 5 bliana nó níos mó léi

source: In that case, the Gardai must have reasonable cause to suspect that you are guilty of an offence
ga: Sa chás sin ní mór go mbeadh cúis réasúnta ag na Gardaí le bheith in amhras gur tusa atá ciontach as coir

source: Once you are arrested, you must be brought to a Garda station without undue delay and informed that you have a right to consult a solicitor. See our document on treatment in custody
ga: Nuair atá tú gafa ní mór tú a thabhairt chuig stáisiún Garda gan aon mhoill mhíchuí agus chuir in iúl go bhfuil sé de cheart dul i gcomhairle le haturnae tú

source: You must be told the reason for your arrest. The Gardaí do not have to inform you in any particular form the reason and legal basis for your arrest
ga: Ní mór a chur in iúl duit cén fáth a bhfuil tú gafa - ní mór don Gharda a ghabh thú a insint duit go díreach cén choir lena bhfuil tú gafa

source: For example, if you are arrested for drink driving the Garda is not obliged to cite the specific provision ("I am arresting you under the provisions of Section 49 (8) of the Road Traffic Act, 1961")
ga: Muna bhfuil sa ghabháil ach cur i gcéill ar mhaithe le tú a cheistiú maidir le coireanna eile is gabháil neamhdhleathach atá inti

source: Your arrest is unlawful if the Garda fails to inform you in ordinary language the reason for your arrest or fails to cite the relevant law
ga: Nuair atá tú gafa, tá sé de cheart agat a bheith tugtha ós comhair na cúirte chomh luath agus is féidir

source: If your arrest is just a sham or a cover so that you can be questioned in relation to other offences, then that arrest is unlawful
ga: Tá sé leagtha síos i reachtaíocht éagsúil cé chomh fada gur féidir thú a choinneáil le ceistiú

source: However, if the reasons for your arrest are given to you at any time during your detention, your custody becomes lawful from that point on
ga: Sa chuid is mó cásanna nuair atá duine gafa as coir lena mbaineann príosúnacht 5 bliana nó níos mó, ní féidir é/í a choinneáil ach ar feadh 12 uair

source: When you are arrested, you have a right to be brought before a court at the first possible opportunity
ga: Cé go bhfuil tú faoi choinneáil, tá ceart bunreachtúil rochtain réasúnach dlíodóir agat

source: Different legislation specifies how long you may be held in detention for questioning
ga: Tá ceart agat chun a insint gur féidir leat dul i gcomhairle le haturnae

source: If you ask for a solicitor you cannot be questioned until they arrive, except in exceptional circumstances
ga: Má iarrann tú le haghaidh aturnae nach féidir leat a cheistiú go dtí go sroicheann siad

source: You have a right to have your solicitor in the room with you while you are being interviewed
ga: Tá sé de cheart go mbeadh do aturnae sa seomra agallaimh

source: If you have been unlawfully arrested, evidence obtained as a result of that arrest will be inadmissible
ga: Má dhéantar tú a ghabháil go neamhdhleathach ní bheidh aon fhianaise a bhailítear dá bharr ceadaithe

source: For example, if you were mistakenly told by a Garda that you were being arrested under the wrong section of the Road Traffic Act, the arrest and the blood sample taken would be unlawful
ga: Mar shampla, má dhéanann Garda botún agus má insíonn sé/sí duit go bhfuil tú dhá ghabháil faoin gcuid mícheart den Acht um Thrácht Bhóthair, bheadh an ghabháil agus an sampla fola a tógadh neamhdhleathach

source: The blood sample would not be admissible as evidence
ga: Ní bheadh an sampla fola ceadaithe mar fhianaise

source: Evidence obtained while you are unlawfully detained has also been unlawfully obtained and will be inadmissible
ga: Aon fhianaise a fritheadh nuair a bhí tú coinnithe go neamhdhleathach fritheadh í go neamhdhleathach freisin agus ní bheidh sí ceadaithe

source: For example, if you have been in custody for longer than the maximum period allowed and you make a confession, that confession will not be admissible in evidence against you
ga: Mar shampla, má bhí tú coinnithe ar feadh achair níos faide ná an uasthréimhse atá ceadaithe agus má admhaíonn tú don choir, ní bheidh an admháil sin ceadaithe mar fhianaise i do choinne

source: Evidence obtained in breach of your right to reasonable access to a lawyer is also inadmissible as evidence against you
ga: Níl aon fhianaise a fhaightear a sharaíonn an ceart atá agat teacht ar dhlíodóir ceadaithe mar fhianaise i do choinne freisin

source: For example, if you request a lawyer and your request is refused, any statements you make to the police will be inadmissible as evidence against you
ga: Mar shampla, má iarrann tú labhairt le dlíodóir agus má dhiúltaítear don éileamh sin, d'fhéadfadh aon ráitis a dhéanann tú do na Gardaí a bheith neamhcheadaithe mar fhianaise i do choinne
